## Gruplandırmak - groupby

In [1]:
import numpy as np
import pandas as pd

In [21]:
sozluk = {"Departman" : ["Yazılım", "Yazılım", "Pazarlama", "Finans", "Finans","Hukuk"],
         "Calisan Kisi": ["Yigit", "Sercan","Reyhan","Liliya","Darya","Evgenia"],
         "Maas ": [100, 120, 230, 310, 189, 154]}

In [22]:
maasDataFrame = pd.DataFrame(data = sozluk)

In [23]:
maasDataFrame

   Departman Calisan Kisi  Maas
0    Yazılım        Yigit    100
1    Yazılım       Sercan    120
2  Pazarlama       Reyhan    230
3     Finans       Liliya    310
4     Finans        Darya    189
5      Hukuk      Evgenia    154

In [24]:
grupObjesi = maasDataFrame.groupby("Departman")

In [25]:
grupObjesi

In [27]:
grupObjesi.count() # grup objesi ile birlikte pek çok metod uygulanabilir

           Calisan Kisi  Maas
Departman
Finans                2      2
Hukuk                 1      1
Pazarlama             1      1
Yazılım               2      2

In [28]:
grupObjesi.mean()

           Maas
Departman
Finans     249.5
Hukuk      154.0
Pazarlama  230.0
Yazılım    110.0

In [30]:
grupObjesi.cumsum() # kümülatif toplam

   Maas
0    100
1    220
2    230
3    310
4    499
5    154

## Önemli

In [32]:
grupObjesi.describe() # burada genel değerleri verir

          Maas
          count   mean        std    min     25%    50%     75%    max
Departman
Finans      2.0  249.5  85.559921  189.0  219.25  249.5  279.75  310.0
Hukuk       1.0  154.0        NaN  154.0  154.00  154.0  154.00  154.0
Pazarlama   1.0  230.0        NaN  230.0  230.00  230.0  230.00  230.0
Yazılım     2.0  110.0  14.142136  100.0  105.00  110.0  115.00  120.0